 # Połączenie z bazą danych przy pomocy sqlAlchemy

In [1]:
import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

 # Połączenie z bazą danych przy pomocy psycopg2 i pandas

In [2]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

Zapytanie do bazy i wypisanie wyników

In [3]:
df = pd.read_sql('select * from city',con=connection)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

## 1. Ile kategorii filmów mamy w wypożyczalni?

In [4]:
df = pd.read_sql('select count(category_id) from category', con=connection_sqlalchemy)
df

   count
0     16

## 2. Wyświetl listę kategorii w kolejności alfabetycznej.

In [5]:
df = pd.read_sql('select name from category order by name asc', con=connection_sqlalchemy)
df

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## 3. Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [6]:
df = pd.read_sql('select min(release_year), max(release_year) from film', con=connection_sqlalchemy)
df

    min   max
0  2006  2006

## 4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [7]:
df = pd.read_sql("select count(*) from rental where rental_date between '2005-07-01' AND '2005-08-01'", con=connection_sqlalchemy)
df

   count
0   6709

## 5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [8]:
df = pd.read_sql("select count(*) from rental where rental_date between '2010-01-01' AND '2011-02-01'", con=connection_sqlalchemy)
df

   count
0      0

## 6. Znajdź największą płatność wypożyczenia.

In [9]:
df = pd.read_sql("select max(amount) from payment", con=connection_sqlalchemy)
df

     max
0  11.99

## 7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [29]:
df = pd.read_sql(
"""
    SELECT t1.first_name, t1.last_name, t4.country 
    FROM customer t1
    INNER JOIN address t2 ON t1.address_id = t2.address_id
    INNER JOIN city t3 ON t2.city_id = t3.city_id
    INNER JOIN country t4 ON t3.country_id = t4.country_id
    WHERE t4.country IN ('America', 'Nigeria', 'Bangladesh')
"""
, con=connection_sqlalchemy)

df

   first_name last_name     country
0       Sonia   Gregory     Nigeria
1      Rodney   Moeller     Nigeria
2     Stephen    Qualls  Bangladesh
3       Velma     Lucas     Nigeria
4     Marilyn      Ross     Nigeria
5       Elsie    Kelley     Nigeria
6      Gladys  Hamilton     Nigeria
7       Frank  Waggoner  Bangladesh
8       Carol    Garcia     Nigeria
9        Olga   Jimenez     Nigeria
10     Bertha  Ferguson     Nigeria
11     Tracey   Barrett     Nigeria
12         Jo    Fowler     Nigeria
13    Wallace     Slone     Nigeria
14   Michelle     Clark  Bangladesh
15  Constance      Reid     Nigeria

## 8. Gdzie mieszkają członkowie personelu?

In [11]:
df = pd.read_sql(
"""
    SELECT DISTINCT t4.country
    FROM staff t1
    INNER JOIN address t2 ON t1.address_id = t2.address_id
    INNER JOIN city t3 ON t2.city_id = t3.city_id
    INNER JOIN country t4 ON t3.country_id = t4.country_id
"""
, con=connection_sqlalchemy)

df

     country
0  Australia
1     Canada

## 9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [26]:
df = pd.read_sql(
"""
    SELECT COUNT(*)
    FROM staff t1
    INNER JOIN address t2 ON t1.address_id = t2.address_id
    INNER JOIN city t3 ON t2.city_id = t3.city_id
    INNER JOIN country t4 ON t3.country_id = t4.country_id
    WHERE t4.country IN ('Argentina', 'Spain')
"""
, con=connection_sqlalchemy)

df

   count
0      0

## 10. Jakie kategorie filmów zostały wypożyczone przez klientów?

In [14]:
df = pd.read_sql(
"""
    SELECT DISTINCT t5.name
    FROM rental t1
    INNER JOIN inventory t2 ON t1.inventory_id = t2.inventory_id
    INNER JOIN film t3 ON t2.film_id = t3.film_id
    INNER JOIN film_category t4 ON t3.film_id = t4.film_id
    INNER JOIN category t5 ON t4.category_id = t5.category_id
"""
, con=connection_sqlalchemy)

df

           name
0        Horror
1        Comedy
2         Drama
3        Sci-Fi
4       Foreign
5      Classics
6         Games
7        Travel
8           New
9         Music
10       Action
11  Documentary
12       Sports
13    Animation
14     Children
15       Family

## 11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [35]:
df = pd.read_sql(
"""
    SELECT t8.name
    FROM store t1
    INNER JOIN address t2 ON t1.address_id = t2.address_id
    INNER JOIN city t3 ON t2.city_id = t3.city_id
    INNER JOIN country t4 ON t3.country_id = t4.country_id
    INNER JOIN inventory t5 ON t1.store_id = t5.store_id
    INNER JOIN film t6 ON t5.film_id = t6.film_id
    INNER JOIN film_category t7 ON t6.film_id = t7.film_id
    INNER JOIN category t8 ON t7.category_id = t8.category_id
    WHERE t4.country = 'America'
"""
, con=connection_sqlalchemy)

df

Empty DataFrame
Columns: [name]
Index: []

## 12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [30]:
df = pd.read_sql(
"""
    SELECT t2.title
    FROM film_actor t1
    INNER JOIN film t2 ON t1.film_id = t2.film_id
    INNER JOIN actor t3 ON t1.actor_id = t3.actor_id
    WHERE t3.first_name IN ('Olympia','Julia','Ellen')
    AND t3.last_name IN ('Pfeiffer','Zellweger','Presley')
"""
, con=connection_sqlalchemy)

df

                title
0     Bilko Anonymous
1   Caribbean Liberty
2    Casper Dragonfly
3    Empire Malkovich
4       Floats Garden
..                ...
64       Outlaw Hanky
65    Panky Submarine
66   Rider Caddyshack
67          Won Dares
68      Wyoming Storm

[69 rows x 1 columns]